zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/ip/cyip_gpio.h
/* GPIO.INTR_CAUSE0 */
#define GPIO_INTR_CAUSE0_PORT_INT_Pos           0UL
#define GPIO_INTR_CAUSE0_PORT_INT_Msk           0xFFFFFFFFUL
/* GPIO.INTR_CAUSE1 */
#define GPIO_INTR_CAUSE1_PORT_INT_Pos           0UL
#define GPIO_INTR_CAUSE1_PORT_INT_Msk           0xFFFFFFFFUL
/* GPIO.INTR_CAUSE2 */
#define GPIO_INTR_CAUSE2_PORT_INT_Pos           0UL
#define GPIO_INTR_CAUSE2_PORT_INT_Msk           0xFFFFFFFFUL
/* GPIO.INTR_CAUSE3 */
#define GPIO_INTR_CAUSE3_PORT_INT_Pos           0UL
#define GPIO_INTR_CAUSE3_PORT_INT_Msk           0xFFFFFFFFUL
/* GPIO.VDD_ACTIVE */
#define GPIO_VDD_ACTIVE_VDDIO_ACTIVE_Pos        0UL
#define GPIO_VDD_ACTIVE_VDDIO_ACTIVE_Msk        0xFFFFUL
#define GPIO_VDD_ACTIVE_VDDA_ACTIVE_Pos         30UL
#define GPIO_VDD_ACTIVE_VDDA_ACTIVE_Msk         0x40000000UL
#define GPIO_VDD_ACTIVE_VDDD_ACTIVE_Pos         31UL
#define GPIO_VDD_ACTIVE_VDDD_ACTIVE_Msk         0x80000000UL
/* GPIO.VDD_INTR */
#define GPIO_VDD_INTR_VDDIO_ACTIVE_Pos          0UL
#define GPIO_VDD_INTR_VDDIO_ACTIVE_Msk          0xFFFFUL
#define GPIO_VDD_INTR_VDDA_ACTIVE_Pos           30UL
#define GPIO_VDD_INTR_VDDA_ACTIVE_Msk           0x40000000UL
#define GPIO_VDD_INTR_VDDD_ACTIVE_Pos           31UL
#define GPIO_VDD_INTR_VDDD_ACTIVE_Msk           0x80000000UL
/* GPIO.VDD_INTR_MASK */
#define GPIO_VDD_INTR_MASK_VDDIO_ACTIVE_Pos     0UL
#define GPIO_VDD_INTR_MASK_VDDIO_ACTIVE_Msk     0xFFFFUL
#define GPIO_VDD_INTR_MASK_VDDA_ACTIVE_Pos      30UL
#define GPIO_VDD_INTR_MASK_VDDA_ACTIVE_Msk      0x40000000UL
#define GPIO_VDD_INTR_MASK_VDDD_ACTIVE_Pos      31UL
#define GPIO_VDD_INTR_MASK_VDDD_ACTIVE_Msk      0x80000000UL
/* GPIO.VDD_INTR_MASKED */
#define GPIO_VDD_INTR_MASKED_VDDIO_ACTIVE_Pos   0UL
#define GPIO_VDD_INTR_MASKED_VDDIO_ACTIVE_Msk   0xFFFFUL
#define GPIO_VDD_INTR_MASKED_VDDA_ACTIVE_Pos    30UL
#define GPIO_VDD_INTR_MASKED_VDDA_ACTIVE_Msk    0x40000000UL
#define GPIO_VDD_INTR_MASKED_VDDD_ACTIVE_Pos    31UL
#define GPIO_VDD_INTR_MASKED_VDDD_ACTIVE_Msk    0x80000000UL
/* GPIO.VDD_INTR_SET */
#define GPIO_VDD_INTR_SET_VDDIO_ACTIVE_Pos      0UL
#define GPIO_VDD_INTR_SET_VDDIO_ACTIVE_Msk      0xFFFFUL
#define GPIO_VDD_INTR_SET_VDDA_ACTIVE_Pos       30UL
#define GPIO_VDD_INTR_SET_VDDA_ACTIVE_Msk       0x40000000UL
#define GPIO_VDD_INTR_SET_VDDD_ACTIVE_Pos       31UL
#define GPIO_VDD_INTR_SET_VDDD_ACTIVE_Msk       0x80000000UL


#endif /* _CYIP_GPIO_H_ */


/* [] END OF FILE */
